Revit 2027 API
BuiltInFailures.EditingFailures.PlacementFailed Property
 Failed to place component.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PlacementFailed { get; }
Public Shared ReadOnly Property PlacementFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PlacementFailed {
	FailureDefinitionId^ get ();
}
static member PlacementFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace